"""Задача 1 (2 балла). Дистанционный датчик посылает сообщения, состоящие
из заглавных латинских букв (от A до Z). Например, сообщение может выглядеть
так: ‘AAACBBBBBDDADDD’. Такое сообщение легко сжать, если заменить группу
одинаковых символов на число, равное количеству повторов символа, и сам
этот символ. То есть, например, группа ‘AAA’ заменится на ‘3A’. При этом
одиночные буквы заменять не нужно, чтобы не произошло увеличения длины.
В результате такого преобразования строка, приведенная в примере,
преобразуется в ‘3AC5B2DA3D’. Напишите программу, выполняющую указанное
преобразование."""
s = str(input("Введите строку: "))
res = ""
i = 0
while i < len(s):
    curr_symb = s[i]      # тек сим для подсчета
    count = 1
    j = i + 1             # идет впереди i пока находит такие же символы
    # подсчитываем сколько одинаковых символов подряд
    while j < len(s) and curr_symb == s[j]:
        count += 1
        j += 1            # к след сим
    # если больше 1 повторения - добавляем число и символ
    if count > 1:
        res += str(count) + curr_symb
    else:
        res += curr_symb  # иначе только символ
    i += count            # перескакиваем на следующую букву
print("Сжатая строка:", res)
